In [1]:
%load_ext sql

In [2]:
%sql sqlite:///stud_db

In [3]:
%%sql CREATE VIEW new_stud_details AS
      SELECT stud_name, stud_email, phone_number, stud_ID
      FROM personal_details
      JOIN school_details ON personal_details.stud_ID = school_details.stud_ID;

 * sqlite:///stud_db
Done.

[]

In [ ]:
%%sql CREATE VIEW full_stud_details AS
      SELECT *
      FROM contact_details
      JOIN school_details ON contact_details.stud_email = school_details.stud_email
      JOIN financial_details ON school_details.stud_ID = financial_details.stud_ID;

In [9]:
%%sql CREATE VIEW updated_financial_details AS
      SELECT
         financial_details,
         CASE
            WHEN financial_details.stud_name IS NULL OR financial_details.stud_name = '' THEN personal_details.stud_name
            ELSE financial_details.stud_name
         END AS updated_stud_name
         FROM financial_details
         JOIN personal_details ON financial_stud_ID = personal_details.stud_ID;

 * sqlite:///stud_db
Done.

[]

In [10]:
%%sql CREATE VIEW financial_details_view AS
      SELECT *,
          CASE WHEN fee_cleared IS NULL THEN 'False' ELSE 'True' END AS fee_cleared
          FROM financial_details;

 * sqlite:///stud_db
Done.

[]

In [11]:
%%sql CREATE VIEW fee_cleared AS
      SELECT national_id, stud_name
      FROM financial_details
      WHERE fee_cleared = 'True'

 * sqlite:///stud_db
Done.

[]

In [12]:
%%sql CREATE VIEW total_fee_balance AS
      SELECT
           SUM(fee_paid) AS total_fees_paid,
           SUM(current_deficit) AS total_current_deficit
      FROM financial_details;

 * sqlite:///stud_db
Done.

[]

In [13]:
%%sql CREATE VIEW home_county_count AS
      SELECT current_home_county, COUNT(*) AS student_count
      FROM school_details
      GROUP BY current_home_county;

 * sqlite:///stud_db
Done.

[]

In [14]:
%%sql CREATE VIEW secondary_school_count AS
      SELECT secondary_school_county,
            SUM(CASE WHEN gender = 'Male' THEN 1 ELSE 0 END) AS male_count,
            SUM(CASE WHEN gender = 'Female' THEN 1 ELSE 0 END) AS female_count
      FROM school_details
      GROUP BY secondary_school_county;

 * sqlite:///stud_db
Done.

[]

In [15]:
%%sql CREATE VIEW kin_percentage AS
      SELECT CASE WHEN next_of_kin = 'Mother' THEN 'Mother' ELSE 'Father1' END AS kin_type,
             COUNT(*) AS kin_count,
             COUNT(*) * 100.0 / (SELECT COUNT(*) FROM contact_details) AS percentage
      FROM contact_details
      WHERE next_of_kin IN ('Mother', 'Father1')
      GROUP BY kin_type;

 * sqlite:///stud_db
Done.

[]